Revit 2026 API

# IStructuralSectionsServer Methods

---

The IStructuralSectionsServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | StructuralSectionsUpdate | The server's method that will be called when Revit User clicks the Section Type parameter's button in the family dialog. |

#### Reference

IStructuralSectionsServer Interface

Autodesk.Revit.DB.Structure Namespace